#+PROPERTY: HEADER-ARGS:DASH+ :exports results
#+PROPERTY: HEADER-ARGS:DASH+ :dir /tmp/
#+PROPERTY: HEADER-ARGS:TEX-DOC+ :tangle /tmp/main.tex

* Examples

To understand this section, we recommend viewing this file as raw text.

** Simple examples

#+BEGIN_SRC tex-doc
bar
#+END_SRC

#+BEGIN_SRC dash
cat main.tex
#+END_SRC

#+RESULTS:
#+begin_example
%% This file is intended to be compiled by executing the following
%% commands:
%% $ pdflatex {filename}

\documentclass{standalone}

\begin{document}

bar

\end{document}
#+end_example

We don't necessarily need to use LaTeX. This package is intended for all flavours of TeX!

#+HEADER: :compile tex
#+HEADER: :enclose no
#+HEADER: :class no
#+begin_src tex-doc
foo \end
#+end_src

#+begin_src dash  
cat main.tex
#+end_src

#+RESULTS:
#+begin_example
%% This file is intended to be compiled by executing the following
%% commands:
%% $ tex {filename}

foo \end
#+end_example

** All header arguments

The following example shows how a single line produces a full document.

#+HEADER: :class beamer
#+HEADER: :package a b c
#+HEADER: :prologue prologue
#+HEADER: :epilogue epilogue
#+HEADER: :preamble preamble
#+HEADER: :comment yes
#+HEADER: :compile xelatex -shell-escape && biber --nolog && xelatex -shell-escape
#+HEADER: :eval no
#+BEGIN_SRC tex-doc
content
#+END_SRC

#+begin_src dash
cat main.tex
#+end_src

#+RESULTS:
#+begin_example
%% This file is intended to be compiled by executing the following
%% commands:
%% $ xelatex -shell-escape {filename}
%% $ biber --nolog {filename}
%% $ xelatex -shell-escape {filename}

prologue

\documentclass{beamer}

\usepackage{a}
\usepackage{b}
\usepackage{c}

preamble

\begin{document}

content

\end{document}

epilogue
#+end_example

** No header arguments

Let's say that you feel overwhelming by the amount of header arguments that =tex-doc= provides. If you want any of those header arguments to affect your code block, but you still want to =C-c C-c= into =tex-doc= code blocks, then just set the =:expand= header argument to =no=.

#+HEADER: :compile tex
#+HEADER: :expand no
#+BEGIN_SRC tex-doc
foo \end
#+END_SRC

#+BEGIN_SRC dash
cat main.tex
#+END_SRC

#+RESULTS:
#+begin_example
foo \end
#+end_example

* Supported header arguments

+ =:prologue=
  + Not documented because already documented in the Org Mode manual.
+ =:epilogue=
  + Not documented because already documented in the Org Mode manual.
+ =:class=
  + A string that is used in =\documentclass{...}=.
+ =:preamble=
  + A string that is located after the =\documentclass= and before the =document= environment.
+ =:enclose=
  + Defines whether the content of the code block need to be enclosed within the =document= environment.
+ =:package=
  + Defines the package that need to be included in the file.
+ =:compile=
  + Defines the compilation steps for compiling the document.
+ =:comment=
  + Defines whether comment with compilation instructions need to be included in the tangled file.
+ =:expand=
  + Defines whether all the other header arguments must take effect.

